
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Инициализация формы: установка заголовка
	Если Параметры.Свойство("Отбор") Тогда 						//Проверка наличия активного отбора в форме списка   
		Если Параметры.Отбор.Свойство("Уволен") Тогда			//Проверяем, содержит ли текущий отбор поле "Уволен" с нужным значением
			ЭтотОбъект.АвтоЗаголовок = Ложь;					//Сбрасываем стандартный заголовок формы перед установкой нового
			Если Параметры.Отбор.Уволен Тогда					//Устанавливаем новый заголовок с указанием типа фильтрации списка("Работающие"/"Уволенные")
				ЭтотОбъект.Заголовок = "Уволенные сотрудники";
			Иначе
				ЭтотОбъект.Заголовок = "Работающие сотрудники";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
