
Процедура ПриНачалеРаботыСистемы()
	
	СегодняДата = ТекущаяДата();
	//СегодняДата = Дата (2025,5,8);
	ЗавтраДата = СегодняДата + 86400;
		
	МассивПраздников = Новый Массив;
	
	НовыйГод = Новый Структура;
	НовыйГод.Вставить("День",1);
	НовыйГод.Вставить("Месяц",1);
	НовыйГод.Вставить("Название", "Новый год");
	МассивПраздников.Добавить(НовыйГод);
	
	Рождество = Новый Структура;
	Рождество.Вставить("День",7);
	Рождество.Вставить("Месяц",1);
	Рождество.Вставить("Название", "Рождество Христово");
	МассивПраздников.Добавить(Рождество);
	
	ДеньПобеды = Новый Структура;
	ДеньПобеды.Вставить("День",9);
	ДеньПобеды.Вставить("Месяц",5);
	ДеньПобеды.Вставить("Название", "День Победы");
	МассивПраздников.Добавить(ДеньПобеды);
	
	ДеньРоссии = Новый Структура;
	ДеньРоссии.Вставить("День",12);
	ДеньРоссии.Вставить("Месяц",5);
	ДеньРоссии.Вставить("Название", "День России");
	МассивПраздников.Добавить(ДеньРоссии);
	
	Для Каждого Праздник из МассивПраздников Цикл 
		
		ПраздничныйДень = Праздник.День;
		ПраздничныйМесяц = Праздник.Месяц;
		СегодняПраздник = (День(СегодняДата) = ПраздничныйДень И Месяц(СегодняДата) = ПраздничныйМесяц);
		ЗавтраПраздник = (День(ЗавтраДата) = ПраздничныйДень И Месяц(ЗавтраДата) = ПраздничныйМесяц);

		Если СегодняПраздник Тогда
			Сообщить (СтрШаблон ("Поздраляем с праздиком: %1", Праздник.Название));
		ИначеЕсли ЗавтраПраздник Тогда
			Сообщить (СтрШаблон ("Завтра праздник: %1", Праздник.Название));
		КонецЕсли;
		
	КонецЦикла;
	
	ДеньРожденияПользователя = СотрудникиВызовСервера.ДеньРожденияТекущегоПользователя();
	Если ДеньРожденияПользователя <> Неопределено Тогда
		Если (День(СегодняДата) = День(ДеньРожденияПользователя)) И (Месяц(СегодняДата) = Месяц(ДеньРожденияПользователя)) Тогда
			Сообщить ("С днем рождения!");
		КонецЕсли;
	КонецЕсли;
	
	//ДатаСегодня = ТекущаяДата();  
	//СегодняДеньНеделиЧисло = ДеньНедели(ДатаСегодня);
	//СегодняДеньНеделиСтр = Формат(ДатаСегодня,"ДФ=dddd");
	//СейчасВремя = Час(ДатаСегодня);
	//
	//Если СегодняДеньНеделиЧисло < 6 Тогда
	//	
	//	Если СейчасВремя < 9 Тогда
	//		СостояниеРабочегоВремени = "еще не началось";
	//	ИначеЕсли СейчасВремя >= 18 Тогда
	//		СостояниеРабочегоВремени = "завершилось";
	//	Иначе
	//		СостояниеРабочегоВремени = "идет";
	//	КонецЕсли;
	//	
	//	Уведомление = СтрШаблон("Сегодня %1, будний день. Рабочее время %2.",СегодняДеньНеделиСтр,СостояниеРабочегоВремени);
	//Иначе                     
	//	Уведомление = СтрШаблон("Сегодня %1, выходной день.", СегодняДеньНеделиСтр);
	//КонецЕсли;
	//Сообщить(Уведомление);
	
	
	//ДатаСегодня = ТекущаяДата();   
	//ФорматДатаСегодня = Формат(ДатаСегодня,"ДФ='дд ММММ'");
	//ГодСегодня = Год(ДатаСегодня);  
	//МесяцСегодня = Месяц(ДатаСегодня);
	//ДеньСегодня = День(ДатаСегодня);
	//НачалоРабДня = Дата(ГодСегодня, МесяцСегодня, ДеньСегодня, 9,0,0);
	//СекундСНачалаРабДня =  ДатаСегодня - НачалоРабДня;
	//МинутСНачалаРабДня = Цел (СекундСНачалаРабДня/60);       
	//
	//Если СекундСНачалаРабДня >= 0 Тогда
	//	Сообщить("Сегодня " + ФорматДатаСегодня + "; минут с начала рабочего дня: " + МинутСНачалаРабДня + ".");
	//Иначе
	//	Сообщить("Сегодня " + ФорматДатаСегодня + "; минут до начала рабочего дня: " + ((-1)*МинутСНачалаРабДня) + ".");
	//КонецЕсли;
	
КонецПроцедуры

