
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	// Обработка фильтрации по статусу (Уволен/Работающие)
    // ПараметрКоманды: True - уволенные, False - работающие
	ОтборВСписке = Новый Структура;
	ОтборВСписке.Вставить("Уволен", Ложь);
	ПараметрыФормы = Новый Структура("Отбор", ОтборВСписке);
	ОткрытьФорму("Справочник.Сотрудники.ФормаСписка", ПараметрыФормы, 
					ПараметрыВыполненияКоманды.Источник, 
					"Работает", 
					ПараметрыВыполненияКоманды.Окно, 
					ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
